Repository: credativ/postgresql-common
Catalog: postgresql-common/debian/po/*.po
Languages: cs

source: Obsolete major version ${old}
cs: Zastaralá hlavní verze ${old}

source: The PostgreSQL version ${old} is obsolete, but you still have the server and/or client package installed. Please install the latest packages (postgresql-${latest} and postgresql-client-${latest}) and upgrade your existing ${oldversion} clusters with pg_upgradecluster (see manpage).
cs: PostgreSQL verze ${old} je již zastaralá, ale v systému se stále nachází balík se serverem a/nebo klientem. Nainstalujte prosím nejnovější balíky (postgresql-${latest} a postgresql-client-${latest}) a aktualizujte své klastry ${oldversion} pomocí pg_upgradecluster (viz manuálová stránka).

source: Please be aware that the installation of postgresql-${latest} will automatically create a default cluster ${latest}/main. If you want to upgrade the ${old}/main cluster, you need to remove the already existing ${latest} cluster (pg_dropcluster --stop ${latest} main, see manpage for details).
cs: Vemte prosím na vědomí, že instalací postgresql-${latest} se automaticky vytvoří výchozí klastr ${latest}/main. Chcete-li aktualizovat klastr ${old}/main, musíte odstranit nově vytvořený klastr ${latest} (pg_dropcluster --stop ${latest} main, viz manuálová stránka).

source: The old server and client packages are not supported any more. After having upgraded the existing clusters, you should remove the postgresql-${old} and postgresql-client-${old} packages.
cs: Staré balíčky serveru a klienta již nejsou podporovány, Po převodu stávajících klastrů byste měli balíčky postgresql-${old} a postgresql-client-${old} odstranit.

source: Untransitioned postgresql package
cs: Nedokončený přechod balíku postgresql

source: The current postgresql package is in state 'removed', but its data and configuration files are still present in the system. This is incompatible with the new multiversion/multicluster structure.
cs: Současný balík postgresql je ve stavu "odstraněný", ale jeho data a konfigurační soubory se stále nachází v systému. To není slučitelné s novou strukturou podporující více verzí a více klastrů.

source: You need to do one of the following:
cs: Musíte provést jedno z následujícího:

source: (1) If you do not need the databases and configuration files any more, purge the old packages (dpkg -P postgresql postgresql-client).
cs: (1) Pokud již původní databáze a konfigurační soubory nepotřebujete, vyčistěte staré balíky (dpkg -P postgresql postgresql-client).

source: (2) If you want to retain the current databases and configuration files, upgrade to the transitional packages by installing the latest version of 'postgresql' (apt-get install postgresql).
cs: (2) Chcete-li zachovat stávající databáze a konfigurační soubory, aktualizujte na nejnovější verzi přechodných balíků postgresql (apt-get install postgresql).

source: After that you can reattempt this installation.
cs: Poté se můžete pokusit v instalaci pokračovat.
